---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSingleCurveMultipleIntersBetweenOppositeVirtualGrids
source: html/c378ea43-dc1d-a2e6-cc09-927d42b6d8cb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSingleCurveMultipleIntersBetweenOppositeVirtualGrids Property

There are curves in splitting chain of virtual splitters defined by these elements which intersect each other multiple times and so one of the virtual splitters will be ignored

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceSingleCurveMultipleIntersBetweenOppositeVirtualGrids { get; }
```